In [1]:
from os import path
fname = path.expanduser(r'C:\Users\imran\OneDrive\Documents\GitHub\pythonLinkedIn\pythonWithLinkedIn\Python Scientific Stack\Exercise Files\Ch04\04_02\track.csv')

In [2]:
#File size in bytes
path.getsize(fname)

43844

In [3]:
#File size in kilobytes
path.getsize(fname)/ (1<<10)

42.81640625

In [4]:
with open(fname) as fp:
    for lnum, line in enumerate(fp):
        if lnum > 10:
            break
        print(line)

time,lat,lng,height

2015-08-20 03:48:07.235,35.015021,32.519585,136.1999969482422

2015-08-20 03:48:24.734,35.014954,32.519606,126.5999984741211

2015-08-20 03:48:25.660,35.014871,32.519612,123.0

2015-08-20 03:48:26.819,35.014824,32.519654,120.5

2015-08-20 03:48:27.828,35.014776,32.519689,118.9000015258789

2015-08-20 03:48:29.720,35.014704,32.519691,119.9000015258789

2015-08-20 03:48:30.669,35.014657,32.519734,120.9000015258789

2015-08-20 03:48:33.793,35.014563,32.519719,121.69999694824219

2015-08-20 03:48:34.869,35.014549,32.519694,121.19999694824219

2015-08-20 03:48:37.708,35.014515,32.519625,121.69999694824219

In [5]:
#To check how many entries (rows) of data, sum up all the lines ( 1 per line)
with open(fname) as fp:
    print(sum(1 for line in fp))

741

In [6]:
#Now load the data into pandas
import pandas as pd
#Traditionally call the loaded data df
df = pd.read_csv(fname)

In [7]:
#How many rows?
#740, 1 row less? it uses the first row as column names.
len(df)

740

In [8]:
df.columns

Index(['time', 'lat', 'lng', 'height'], dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 740 entries, 0 to 739
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   time    740 non-null    object
 1   lat     740 non-null    float64
 2   lng     740 non-null    float64
 3   height  740 non-null    float64
dtypes: float64(3), object(1)
memory usage: 23.2+ KB

In [10]:
df.head()

                      time        lat        lng      height
0  2015-08-20 03:48:07.235  35.015021  32.519585  136.199997
1  2015-08-20 03:48:24.734  35.014954  32.519606  126.599998
2  2015-08-20 03:48:25.660  35.014871  32.519612  123.000000
3  2015-08-20 03:48:26.819  35.014824  32.519654  120.500000
4  2015-08-20 03:48:27.828  35.014776  32.519689  118.900002

In [11]:
#Pandas does a good job at guessing type, json files are better as it loads it all as string.
df.dtypes

time       object
lat       float64
lng       float64
height    float64
dtype: object

In [12]:
# https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html
# Source code:  https://github.com/pandas-dev/pandas/blob/v1.3.3/pandas/io/excel/_base.py#L1238-L1293

In [13]:
# We changed the time column from an object to a datetimes64[ns] format
df = pd.read_csv(fname, parse_dates=['time'])

In [14]:
df.dtypes

time      datetime64[ns]
lat              float64
lng              float64
height           float64
dtype: object

In [15]:
#access data via columns
df['lat']

0      35.015021
1      35.014954
2      35.014871
3      35.014824
4      35.014776
         ...
735    35.014387
736    35.014355
737    35.014279
738    35.014264
739    35.014212
Name: lat, Length: 740, dtype: float64

In [16]:
#you can do dot lat too but sometimes column names have spaces and you can't use it.
df.lat.head()

0    35.015021
1    35.014954
2    35.014871
3    35.014824
4    35.014776
Name: lat, dtype: float64

In [17]:
#You can pick more than one column
df[['lat', 'lng']]

           lat        lng
0    35.015021  32.519585
1    35.014954  32.519606
2    35.014871  32.519612
3    35.014824  32.519654
4    35.014776  32.519689
..         ...        ...
735  35.014387  32.517020
736  35.014355  32.517035
737  35.014279  32.517087
738  35.014264  32.517098
739  35.014212  32.517142

[740 rows x 2 columns]

In [18]:
# A specific column and row
df['lat'][0]

35.015021

In [19]:
# AN entire row using the loc
df.loc[0]

time      2015-08-20 03:48:07.235000
lat                        35.015021
lng                        32.519585
height                    136.199997
Name: 0, dtype: object

In [20]:
#Loc can work with slices as well
#loc slices return both the start and ending index
df.loc[2:7]

                     time        lat        lng      height
2 2015-08-20 03:48:25.660  35.014871  32.519612  123.000000
3 2015-08-20 03:48:26.819  35.014824  32.519654  120.500000
4 2015-08-20 03:48:27.828  35.014776  32.519689  118.900002
5 2015-08-20 03:48:29.720  35.014704  32.519691  119.900002
6 2015-08-20 03:48:30.669  35.014657  32.519734  120.900002
7 2015-08-20 03:48:33.793  35.014563  32.519719  121.699997

In [21]:
#Multiply  columns and rows
df[['lat', 'lng']][2:7]
# Row 7 isn't included now

         lat        lng
2  35.014871  32.519612
3  35.014824  32.519654
4  35.014776  32.519689
5  35.014704  32.519691
6  35.014657  32.519734

In [22]:
df.index

RangeIndex(start=0, stop=740, step=1)

In [23]:
import numpy as np
df1 = pd.DataFrame(np.arange(10).reshape((5,2)), columns=['x', 'y'], index=['a', 'b', 'c', 'd', 'e'])
df1

   x  y
a  0  1
b  2  3
c  4  5
d  6  7
e  8  9

In [24]:
# df1.loc[0] won't work as it works by label, our label is a not 0.
df1.loc['a']

x    0
y    1
Name: a, dtype: int32

In [25]:
df1.loc['b': 'd']

   x  y
b  2  3
c  4  5
d  6  7

In [26]:
df.index

RangeIndex(start=0, stop=740, step=1)

In [27]:
#You can change the index to a time index (different column)
df.index = df['time']
df.index
#df.loc[0] will not work now.

DatetimeIndex(['2015-08-20 03:48:07.235000', '2015-08-20 03:48:24.734000',
               '2015-08-20 03:48:25.660000', '2015-08-20 03:48:26.819000',
               '2015-08-20 03:48:27.828000', '2015-08-20 03:48:29.720000',
               '2015-08-20 03:48:30.669000', '2015-08-20 03:48:33.793000',
               '2015-08-20 03:48:34.869000', '2015-08-20 03:48:37.708000',
               ...
               '2015-08-20 04:20:18.844000', '2015-08-20 04:20:21.996000',
               '2015-08-20 04:20:22.897000', '2015-08-20 04:20:24.905000',
               '2015-08-20 04:20:25.835000', '2015-08-20 04:20:28.982000',
               '2015-08-20 04:20:29.923000', '2015-08-20 04:20:32.863000',
               '2015-08-20 04:20:33.994000', '2015-08-20 04:20:42.329000'],
              dtype='datetime64[ns]', name='time', length=740, freq=None)

In [28]:
df.loc['2015-08-20 03:48']
#You will get all the entries with that time index

,time,lat,lng,height
time,,,,
2015-08-20 03:48:07.235,2015-08-20 03:48:07.235,35.015021,32.519585,136.199997
2015-08-20 03:48:24.734,2015-08-20 03:48:24.734,35.014954,32.519606,126.599998
2015-08-20 03:48:25.660,2015-08-20 03:48:25.660,35.014871,32.519612,123.000000
2015-08-20 03:48:26.819,2015-08-20 03:48:26.819,35.014824,32.519654,120.500000
2015-08-20 03:48:27.828,2015-08-20 03:48:27.828,35.014776,32.519689,118.900002
2015-08-20 03:48:29.720,2015-08-20 03:48:29.720,35.014704,32.519691,119.900002
2015-08-20 03:48:30.669,2015-08-20 03:48:30.669,35.014657,32.519734,120.900002
2015-08-20 03:48:33.793,2015-08-20 03:48:33.793,35.014563,32.519719,121.699997
2015-08-20 03:48:34.869,2015-08-20 03:48:34.869,35.014549,32.519694,121.199997
2015-08-20 03:48:37.708,2015-08-20 03:48:37.708,35.014515,32.519625,121.699997
2015-08-20 03:48:38.839,2015-08-20 03:48:38.839,35.014505,32.519599,121.800003
2015-08-20 03:48:41.980,2015-08-20 03:48:41.980,35.014481,32.519514,122.599998
2015-08-20 03:48:42.725,2015-08-20 03:48:42.725,35.014472,32.519486,123.000000
2015-08-20 03:48:45.896,2015-08-20 03:48:45.896,35.014439,32.519405,122.699997
2015-08-20 03:48:46.662,2015-08-20 03:48:46.662,35.014432,32.519379,122.699997
2015-08-20 03:48:49.829,2015-08-20 03:48:49.829,35.014414,32.519309,122.699997
2015-08-20 03:48:50.665,2015-08-20 03:48:50.665,35.014400,32.519287,123.300003
2015-08-20 03:48:53.692,2015-08-20 03:48:53.692,35.014372,32.519211,122.300003
2015-08-20 03:48:54.662,2015-08-20 03:48:54.662,35.014365,32.519187,122.599998
2015-08-20 03:48:58.869,2015-08-20 03:48:58.869,35.014337,32.519106,122.000000
2015-08-20 03:48:59.663,2015-08-20 03:48:59.663,35.014331,32.519084,121.800003

In [29]:
import pytz